---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedShapeBuilderTarget.Solid
enum: Autodesk.Revit.DB.TessellatedShapeBuilderTarget
source: html/c445e799-cb1d-a4cb-5333-719f5c19df18.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderTarget.Solid

A solid, i.e., a Geometry, where all edges are shared by two and
 only two faces and which divides all 3d space into bounded inner
 and infinite outer area(s).